{
  "@context": "https://schema.org",
  "@type": "FAQPage",
  "mainEntity": [
    {
      "@type": "Question",
      "name": "What if I exceed the config JSON download limit of my ConfigCat plan?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Don't worry, ConfigCat will keep serving your data and feature flags. Someone from the support team will contact you to discuss your options. You can always check your usage & quota on the ConfigCat Dashboard: https://app.configcat.com/organization/usage."
      }
    },
    {
      "@type": "Question",
      "name": "Where can I find and download my ConfigCat invoices?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "With the Billing Manager role, you can access and download the invoices issued by ConfigCat from the Billing & Invoices page: https://app.configcat.com/organization/billing."
      }
    },
    {
      "@type": "Question",
      "name": "Is it possible to pay ConfigCat via wire transfer?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Using a credit card via the ConfigCat Dashboard is the preferred way of payment, but a wire transfer is also an option for larger subscription plans. For this process, contact ConfigCat directly: https://configcat.com/support"
      }
    },
    {
      "@type": "Question",
      "name": "How do I upgrade my ConfigCat billing plan?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "With the Billing Manager role, you can change your billing plan on the Plans page: https://app.configcat.com/organization/plans"
      }
    },
    {
      "@type": "Question",
      "name": "How do I downgrade my ConfigCat billing plan?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "With the Billing Manager role, you can change your billing plan on the Plans page: https://app.configcat.com/organization/plans"
      }
    },
    {
      "@type": "Question",
      "name": "How can I use ConfigCat at a discounted rate?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Discounts are available through our partnership program. Contact us at https://configcat.com/support/ directly for more information."
      }
    },
    {
      "@type": "Question",
      "name": "How do I change the billing email address where the ConfigCat invoices should be sent?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "You can do this with the Billing Manager role by clicking the Update billing details link on the Billing & Invoices page: https://app.configcat.com/organization/billing"
      }
    },
    {
      "@type": "Question",
      "name": "How do I change my payment method in ConfigCat?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "You can do this with the Billing Manager role by clicking the Update billing details link on the Billing & Invoices page: https://app.configcat.com/organization/billing"
      }
    },
    {
      "@type": "Question",
      "name": "How do I change my billing information in ConfigCat?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "You can do this with the Billing Manager role by clicking the Update billing details link on the Billing & Invoices page: https://app.configcat.com/organization/billing"
      }
    },
    {
      "@type": "Question",
      "name": "The ChargeBee payment gets stuck when trying to subscribe for a paid ConfigCat plan.",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "If you're using Firefox, try switching to a Chromium-based browser that has extensions turned off. If this doesn't work, contact ConfigCat for help: https://configcat.com/support"
      }
    },
    {
      "@type": "Question",
      "name": "The ChargeBee payment throws an error when trying to subscribe for a paid ConfigCat plan.",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "If you're using Firefox, try switching to a Chromium-based browser that has extensions turned off. If this doesn't work, contact ConfigCat for help: https://configcat.com/support"
      }
    },
    {
      "@type": "Question",
      "name": "How do I cancel my ConfigCat account?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "You can do this with the Billing Manager role by clicking the Switch Plan button under the Free plan on the Plans page: https://app.configcat.com/organization/plans"
      }
    },
    {
      "@type": "Question",
      "name": "How do I change my currency in ConfigCat?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "You can do this with the Billing Manager role by using the currency toggle to Switch between USD and EUR on the Plans page: https://app.configcat.com/organization/plans"
      }
    },
    {
      "@type": "Question",
      "name": "Is ConfigCat ISO certified?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Yes, ConfigCat complies with the ISO/IEC 27001:2022 standard for Information Security Management Systems (ISMS). Learn more here: https://configcat.com/iso/"
      }
    },
    {
      "@type": "Question",
      "name": "Which addresses should I whitelist for ConfigCat when setting up my firewall?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "If possible, you can allow the whole 'configcat.com' domain. Alternatively, you can manually whitelist the following addresses: Global CDN: https://cdn-global.configcat.com, EU CDN: https://cdn-eu.configcat.com, The Public Management API: https://api.configcat.com/, The Dashboard URL: https://app.configcat.com/"
      }
    },
    {
      "@type": "Question",
      "name": "I can't log in to ConfigCat because I forgot my two-factor authentication (2FA) code.",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Solution 1: There might be an authenticator app on your phone that you can use to log in to ConfigCat.  Solution 2: Contact your Organization Admin, and ask them to disable 2FA for your account until you set it up again.  Solution 3: Use your recovery codes that you received when you first set your 2FA up."
      }
    },
    {
      "@type": "Question",
      "name": "The Audit log in ConfigCat does not show old operations.",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "The Free plan includes a 7-day retention period. The Pro and Smart plans offer a 35-day retention, while the Enterprise and Dedicated plans provide a 2-year retention."
      }
    },
    {
      "@type": "Question",
      "name": "Is there a way to allow group access to only one config in ConfigCat?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "You can't set config-level access in one product. Instead, split your configs into multiple products with the appropriate permission settings."
      }
    },
    {
      "@type": "Question",
      "name": "I cannot access my ConfigCat account using Google sign-in.",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Browser extensions may interfere with this. Please disable all browser extensions and try again."
      }
    },
    {
      "@type": "Question",
      "name": "How can I be sure that my data is safe at ConfigCat?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "ConfigCat SDKs evaluate feature flags locally, in your application. They send no user data to the ConfigCat servers. See ConfigCat's architecture explained here: https://configcat.com/architecture/."
      }
    },
    {
      "@type": "Question",
      "name": "Can I sign a data processing agreement with ConfigCat?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Yes, ConfigCat is happy to sign a data processing agreement (DPA). You can review our DPA through our Trust Center page: https://configcat.com/trust-center/"
      }
    },
    {
      "@type": "Question",
      "name": "Does ConfigCat collect browser data when serving feature flag data download requests?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "No. ConfigCat doesn't collect, store or process any user or browser fingerprinting data. The data flow is one directional - the SDKs are only downloading the config JSON files and the feature flag evaluation happens in the SDK. ConfigCat doesn't collect any information about the customer's users."
      }
    },
    {
      "@type": "Question",
      "name": "Is ConfigCat's data only hosted within the EU?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Our main infrastructure and database is in the EU, but CDN servers are located both in the EU and globally. You can set where you want us to keep your data, so its always within reach for your needs. You can read more here: https://configcat.com/docs/advanced/data-governance/"
      }
    },
    {
      "@type": "Question",
      "name": "Is it possible to export feature flags in ConfigCat?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Yes! You can export and download your current product as a standard JSON file anytime you want. The export will include: All feature flags and settings together with their values, Targeting Rules, Percentage Options, segments, tags, All configs, All environments, All tags and All segments."
      }
    },
    {
      "@type": "Question",
      "name": "How long does ConfigCat keep my data?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "ConfigCat keeps your organization data as long as activity is seen in that organization. After several months of inactivity, you'll receive email notifications about or plans to delete your organization and all associated data. An organization is considered inactive if it meets the following criteria: no audit log events are generated in the organization, no valid calls are made to the organization via the Public Management API, config JSONs aren't downloaded from the ConfigCat CDN, the organization does not have an active paid subscription."
      }
    },
    {
      "@type": "Question",
      "name": "How can I use AND operators in my Targeting Rules in ConfigCat?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Yes, since Config V2 there is direct support for AND operators in ConfigCat. "
      }
    },
    {
      "@type": "Question",
      "name": "Are percentage options sticky?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Yes. The percentage-based targeting is sticky by design and consistent across all SDKs. More on stickiness and consistency: https://configcat.com/docs/targeting/percentage-options/#stickiness, https://configcat.com/docs/targeting/percentage-options/#consistency"
      }
    },
    {
      "@type": "Question",
      "name": "How to use Targeting Rules in ConfigCat based on confidential data?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "If you want to use Targeting Rules based on email address, phone number, or other sensitive data, you can use the Confidential text comparators: https://configcat.com/docs/targeting/targeting-rule/user-condition/#confidential-text-comparators."
      }
    },
    {
      "@type": "Question",
      "name": "What are Zombie Flags in ConfigCat?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Zombie (Stale) flags are feature flags that have not been changed in the last configurable number of days. Most often, A feature flag that has not been changed for a long time should be removed from your source code and the ConfigCat Dashboard to avoid technical debt."
      }
    },
    {
      "@type": "Question",
      "name": "What is the Zombie Flags Report in ConfigCat?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "The Zombie (Stale) Flags Report is a list of all feature flags that have not been changed in the last configurable number of days. This report can help you identify and remove stale feature flags from your source code. Based on your email preferences, this report is emailed to you every week. You can find more information here: https://app.configcat.com/my-account/zombie-flags-report"
      }
    },
    {
      "@type": "Question",
      "name": "I am not getting the Zombie Feature Flag email report from ConfigCat",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "You can change the frequency, criteria, and scope of the Zombie Feature Flag report from the Dashboard. Please be aware that feature flags are only considered zombie flags if they have not been modified (with save & publish) within the past given timeframe. Currently, it has no connection to the actual usage in your code."
      }
    },
    {
      "@type": "Question",
      "name": "How to avoid technical debt caused by feature flags in ConfigCat?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "The ConfigCat CLI can scan your code, upload code references to the ConfigCat Dashboard and notify you about stale feature flags. You can find more information here: https://configcat.com/docs/advanced/code-references/overview/"
      }
    },
    {
      "@type": "Question",
      "name": "Is there a way to compare flag statuses between two or more environments in ConfigCat?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Yes, you can see the state of all your Feature Flags across all your environments on the overview page on the Dashboard: https://app.configcat.com/overview"
      }
    },
    {
      "@type": "Question",
      "name": "Is there an expiration date for sent invitations to join an organization in ConfigCat?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Invitations are valid for 14 days by default, but you can re-send them anytime to extend their expiration."
      }
    },
    {
      "@type": "Question",
      "name": "I can't see the organization that I just joined in ConfigCat",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "When you create a new account before joining an organization via an invite (such as the one sent by your company via email), ConfigCat will likely create a duplicate organization for you. If you find the organization where you are supposed to be, please delete the duplicate, but make sure you don't accidentally delete the one you want to keep: https://app.configcat.com/organization/preferences"
      }
    },
    {
      "@type": "Question",
      "name": "Is it possible to rename a product or config in ConfigCat?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Yes, you can rename almost everything within ConfigCat. Organizations, products, configs, environments, tags, and feature flags can all be renamed except for feature flag keys."
      }
    },
    {
      "@type": "Question",
      "name": "Can I change my Feature Flag based on a date in ConfigCat?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "You can pass the current date as a custom User Object attribute to the ConfigCat SDK attribute when evaluating the feature flag, and you can use that attribute with our Date and Time comparators in your targeting rules to target specific dates."
      }
    },
    {
      "@type": "Question",
      "name": "Does ConfigCat guarantee percentage distribution?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "ConfigCat guarantees percentage distribution across all SDKs, ensuring that each user receives the same experience every time."
      }
    },
    {
      "@type": "Question",
      "name": "Is it possible to set up an A/B/C test distribution with ConfigCat?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Yes, it is possible. All you have to do is create a text setting and apply the percentage rules. With a normal feature flag, you have only two options - true or false, but with a text setting you can apply as many A/B/n options as you want with the percentages."
      }
    },
    {
      "@type": "Question",
      "name": "Is there a way to create feature flags via ConfigCat's API?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Yes there is. You can find the public management API at: https://api.configcat.com"
      }
    }
  ]
}
