{
    "@context": "https://schema.org",
    "@type": "FAQPage",
    "mainEntity": [
        {
            "@type": "Question",
            "name": "What if I exceed the config.json download limit of my ConfigCat plan?",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "Don't worry, ConfigCat will keep serving your data and feature flags. Someone from the support team will contact you to discuss your options. You can always check your usage & quota on the ConfigCat Dashboard: https://app.configcat.com/organization/usage."
            }
        },
        {
            "@type": "Question",
            "name": "Where can I find and download my ConfigCat invoices?",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "With a Billing Manager role, you can access and download the invoices issued by ConfigCat from the Billing & Invoices page: https://app.configcat.com/organization/billing."
            }
        },
        {
            "@type": "Question",
            "name": "Is it possible to pay ConfigCat via wire transfer?",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "Using a credit card via the ConfigCat Dashboard is the preferred way of payment, but a wire transfer is also an option in larger subscription plans. For this process, contact ConfigCat directly: https://configcat.com/support"
            }
        },
        {
            "@type": "Question",
            "name": "How do I upgrade my ConfigCat billing plan?",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "With a Billing Manager role, you can change your billing plan on the Plans page: https://app.configcat.com/organization/plans"
            }
        },
        {
            "@type": "Question",
            "name": "How do I downgrade my ConfigCat billing plan?",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "With a Billing Manager role, you can change your billing plan on the Plans page: https://app.configcat.com/organization/plans"
            }
        },
        {
            "@type": "Question",
            "name": "How can I use ConfigCat at a discounted rate?",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "This is possible if you join ConfigCat's partnership program or via referrals: https://configcat.com/referrals"
            }
        },
        {
            "@type": "Question",
            "name": "How do I change the billing email address where the ConfigCat invoices should be sent?",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "You can do this with a Billing Manager role by clicking the Update billing details link on the Billing & Invoices page: https://app.configcat.com/organization/billing"
            }
        },
        {
            "@type": "Question",
            "name": "How do I change my payment method in ConfigCat?",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "You can do this with a Billing Manager role by clicking the Update billing details link on the Billing & Invoices page: https://app.configcat.com/organization/billing"
            }
        },
        {
            "@type": "Question",
            "name": "How do I change my billing information in ConfigCat?",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "You can do this with a Billing Manager role by clicking the Update billing details link on the Billing & Invoices page: https://app.configcat.com/organization/billing"
            }
        },
        {
            "@type": "Question",
            "name": "The ChargeBee payment gets stuck when trying to subscribe for a paid ConfigCat plan.",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "If you're using Firefox, try switching to a Chromium-based browser that has extensions turned off. If this doesn't work, contact ConfigCat for help: https://configcat.com/support"
            }
        },
        {
            "@type": "Question",
            "name": "The ChargeBee payment throws an error when trying to subscribe for a paid ConfigCat plan.",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "If you're using Firefox, try switching to a Chromium-based browser that has extensions turned off. If this doesn't work, contact ConfigCat for help: https://configcat.com/support"
            }
        },
        {
            "@type": "Question",
            "name": "How do I cancel my ConfigCat account?",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "You can do this with a Billing Manager role by clicking the Switch Plan button under the Free plan on the Plans page: https://app.configcat.com/organization/plans"
            }
        },
        {
            "@type": "Question",
            "name": "How do I change my currency in ConfigCat?",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "You can do this with a Billing Manager role by using the currency toggle to Switch between USD and EUR on the Plans page: https://app.configcat.com/organization/plans"
            }
        },
        {
            "@type": "Question",
            "name": "Is ConfigCat ISO certified?",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "As of 2022 May 31, ConfigCat has achieved the ISO/IEC 27001:2013 certification for Information Security Management Systems (ISMS). Learn more here: https://configcat.com/iso/"
            }
        },
        {
            "@type": "Question",
            "name": "Which addresses should I whitelist for ConfigCat when setting up my firewall?",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "If possible, you can allow the whole 'configcat.com' domain. Alternatively, you can manually whitelist the following addresses: Global CDN: https://cdn-global.configcat.com, EU CDN: https://cdn-eu.configcat.com, The Public Management API: https://api.configcat.com/, The Dashboard URL: https://app.configcat.com/"
            }
        },
        {
            "@type": "Question",
            "name": "I can't log in to ConfigCat because I forgot my 2FA (Two-factor authentication) code.",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "Solution 1: There might be an authenticator app on your phone that you can use to log in to ConfigCat.  Solution 2: Contact your Organization Admin, and ask them to disable 2FA for your account until you set it up again.  Solution 3: Use your recovery codes that you received when you first set your 2FA up."
            }
        },
        {
            "@type": "Question",
            "name": "The Audit log in ConfigCat does not show old operations.",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "There is a 7-day log retention in the free plan and a longer, 35 day in all the other plans."
            }
        },
        {
            "@type": "Question",
            "name": "Is there a way to allow group access to only one config in ConfigCat?",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "Config access can't be specified in one Product, but you can split your configs into multiple products, each with the necessary permission settings."
            }
        },
        {
            "@type": "Question",
            "name": "I cannot access my ConfigCat account using google sign-in.",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "Browser extensions can interfere with this. Please disable all browser extensions and try again."
            }
        },
        {
            "@type": "Question",
            "name": "How can I be sure that my data is safe at ConfigCat?",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "The feature flag evaluation is done on the client-side in the ConfigCat SDK. So if you are using the SDK, you can be sure that your data will never leave your system. See ConfigCat's architecture explained here: https://configcat.com/architecture/."
            }
        },
        {
            "@type": "Question",
            "name": "Can I sign a data processing agreement with ConfigCat?",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "Yes, ConfigCat is happy to sign a data processing agreement (DPA)"
            }
        },
        {
            "@type": "Question",
            "name": "What browser data is collected, processed or stored by the ConfigCat SDK when pulling feature flag data from the ConfigCat CDN?",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "ConfigCat doesn't collect, store or process any browser data. The data flow is one directional - the SDKs are only downloading the config.json files and the feature flag evaluation happens in the SDK. ConfigCat doesn't collect any information about the customer's users."
            }
        },
        {
            "@type": "Question",
            "name": "Is ConfigCat's data only hosted within the EU?",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "Our main infrastructure and database is in the EU, but CDN servers are located both in the EU and globally. You can set where you want us to keep your data, so its always within reach for your needs. You can read more here: https://configcat.com/docs/advanced/data-governance/"
            }
        },
        {
            "@type": "Question",
            "name": "Is it possible to export feature flags in ConfigCat?",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "Yes! You can export and download your current product as a standard JSON file anytime you want. The export will include: All feature flags and settings together with their values, targeting rules, % options, segments, tags, All configs, All environments, All tags and All segments."
            }
        },
        {
            "@type": "Question",
            "name": "How can I use AND operators in my targeting rules in ConfigCat?",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "Although there is no direct support for AND operators in the UI, you can use the AND operator with a combination of OR and NOT operators. Read more here: https://configcat.com/docs/faq/#can-i-use-and-operators-in-my-targeting-rules"
            }
        },
        {
            "@type": "Question",
            "name": "Are ConfigCat percentage targeting options sticky?",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "Yes. The percentage-based targeting is sticky by design and consistent across all SDKs. More on stickiness and consistency: https://configcat.com/docs/advanced/targeting/#stickiness--consistency"
            }
        },
        {
            "@type": "Question",
            "name": "How to use targeting rules in ConfigCat based on sensitive data?",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "If you want to use targeting rules based on email address, phone number, or other sensitive data, you can use the Confidential text comparators: https://configcat.com/docs/advanced/targeting/#confidential-text-comparators."
            }
        },
        {
            "@type": "Question",
            "name": "What are Zombie Flags in ConfigCat?",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "Zombie (Stale) flags are feature flags that have not been changed in the last configurable number of days. Most often, A feature flag that has not been changed for a long time should be removed from your source code and the ConfigCat Dashboard to avoid technical debt."
            }
        },
        {
            "@type": "Question",
            "name": "What is the Zombie Flags Report in ConfigCat?",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "The Zombie (Stale) Flags Report is a list of all feature flags that have not been changed in the last configurable number of days. This report can help you identify and remove stale feature flags from your source code. Based on your email preferences, this report is emailed to you every week. You can find more information here: https://app.configcat.com/my-account/zombie-flags-report"
            }
        },
        {
            "@type": "Question",
            "name": "I am not getting the Zombie Feature Flag email report from ConfigCat",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "You can change the frequency, criteria, and scope of the Zombie Feature Flag report from the dashboard. Please be aware that feature flags are only considered zombie flags if they have not been modified (with save & publish) within the past given timeframe. Currently, it has no connection to the actual usage in your code."
            }
        },
        {
            "@type": "Question",
            "name": "How to avoid technical debt caused by feature flags in ConfigCat?",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "The ConfigCat CLI can scan your code, upload code references to the ConfigCat Dashboard and notify you about stale feature flags. You can find more information here: https://configcat.com/docs/advanced/code-references/overview/"
            }
        },
        {
            "@type": "Question",
            "name": "Is there a way to compare flag statuses between two or more environments in ConfigCat?",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "Yes, you can see the state of all your Feature Flags across all your environments on the overview page in the dashboard: https://app.configcat.com/overview"
            }
        },
        {
            "@type": "Question",
            "name": "Is there an expiration date for sent invitations to join an organization in ConfigCat?",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "Invitations are valid for 14 days by default, but you can re-send them anytime to extend their expiration."
            }
        },
        {
            "@type": "Question",
            "name": "I can't see the organization that I just joined in ConfigCat",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "When you create a new account before joining an organization via an invite (such as the one sent by your company via email), ConfigCat will likely create a duplicate organization for you. If you find the organization where you are supposed to be, please delete the duplicate, but make sure you don't accidentally delete the one you want to keep: https://app.configcat.com/organization/preferences"
            }
        }
    ]
}
