{
    "@context": "https://schema.org",
    "@type": "FAQPage",
    "mainEntity": [
        {
            "@type": "Question",
            "name": "How to use targeting rules in ConfigCat based on sensitive data?",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "If you want to use targeting rules based on email address, phone number, or other sensitive data, you can use the Confidential text comparators: https://configcat.com/docs/advanced/targeting/#confidential-text-comparators."
            }
        },
        {
            "@type": "Question",
            "name": "What if I exceed the config.json download limit of my ConfigCat plan?",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "Don't worry, we will keep serving your data and feature flags. Someone from our team will contact you to discuss your options."
            }
        },
        {
            "@type": "Question",
            "name": "Where can I find and download my ConfigCat invoices?",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "All the invoices we issued are available for download from the Billing & Invoices page: https://app.configcat.com/organization/billing"
            }
        },
        {
            "@type": "Question",
            "name": "I can't login to ConfigCat because I was asked a 2FA (Two-factor authentication) code that I don't know.",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "Solution 1: There might be an authenticator app on your phone that you can use to log in to ConfigCat.  Solution 2: Contact your Organization Admin, and ask them to disable 2FA for your account until you set it up again.  Solution 3: Use the recovery codes that you received when you first set your 2FA up."
            }
        },
        {
            "@type": "Question",
            "name": "Are ConfigCat percentage targeting options sticky?",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "Yes. The percentage-based targeting is sticky by design and consistent across all SDKs.  Also, consider the following:  - All SDKs evaluate the rules in the exact same way. (10% is the same 10% in all SDKs)  - The percentage rules are sticky by feature flag. (10% is a different 10% for each feature flag)  More on stickiness and consistency: https://configcat.com/docs/advanced/targeting/#stickiness--consistency"
            }
        },
        {
            "@type": "Question",
            "name": "How can I be sure that my data is safe at ConfigCat?",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "The feature flag evaluation is done on the client-side in the ConfigCat SDK. So if you are using the SDK, you can be sure that your data will never leave your system.  See ConfigCat's architecture explained here: https://configcat.com/architecture/."
            }
        }
    ]
}